---
kind: method
id: M:Autodesk.Revit.DB.Architecture.StairsRun.GetLeftSupports
source: html/030d4d7a-26c7-c8ec-a924-d15fa74938d3.htm
---
# Autodesk.Revit.DB.Architecture.StairsRun.GetLeftSupports Method

Retrieves all supports on the left side of run boundaries.

## Syntax (C#)
```csharp
public IList<ElementId> GetLeftSupports()
```

## Returns
The supports on the left side of run boundaries.